#Инвесткопилка
from typing import Any


#Позволяет копить через округление ваших трат.

# Можно задать комфортный порог округления: 10, 50 или 100 ₽. Траты будут округляться, и разница между фактической
# суммой трат по карте и суммой округления будет попадать на счет «Инвесткопилки».


def investment_bank(month: str, transactions: list[dict[str, Any]], limit: int) -> float:
    """которая возвращает сумму, которую удалось бы отложить в «Инвесткопилку»"""




#Функция простого поиска
#Пользователь вводит слово для поиска, возвращается json ответ со всеми транзакциями и категориями